{
  "promos": [
    {
      "id": 1,
      "title": "hello",
      "img": "https://i.picsum.photos/id/641/400/300.jpg"
    },
    {
      "id": 1,
      "title": "hello",
      "img": "https://i.picsum.photos/id/642/400/300.jpg"
    },
    {
      "id": 1,
      "title": "hello",
      "img": "https://i.picsum.photos/id/643/400/300.jpg"
    },
    {
      "id": 1,
      "title": "hello",
      "img": "https://i.picsum.photos/id/644/400/300.jpg"
    },
    {
      "id": 1,
      "title": "hello",
      "img": "https://i.picsum.photos/id/645/400/300.jpg"
    }
  ],
  "authors": [
  {
    "id": 0,
    "author": "Антон Чехов",
    "author_photo": "covers/chehov_photo",
    "authors_description": "Антон Павлович Чехов - русский писатель, общепризнанный классик мировой литературы. По профессии врач. Почётный академик Императорской Академии наук по Разряду изящной словесности. Один из самых известных драматургов мира. Его произведений переведены более чем на 100 языков.",
    "same_authors": [
      {
        "id": 1,
        "id": 2
      }
    ],
    "books": [
      {
        "id": 0,
        "id": 1
      }
    ]
  },
  {
  "id": 1,
  "author": "Сергей Есенин",
  "author_photo": "covers/esenin_photo",
  "authors_description": "Сергей Александрович Есенин является великим русским поэтом-лириком. Большая часть его трудов — это новокрестьянская поэзия, лирика. Позднее творчество относится к ижиманизму, так как в нем прослеживается много использованных образов, метафор. Дата рождения литературного гения — 21 сентября 1895 года. Родом он из Рязанской губернии, села Константиновка (Кузьминская волость). Поэтому многие произведения посвящены любви к Руси, есть много новокрестьянской лирики.",
  "same_authors": [
    {
      "id": 0,
      "id": 2
    }
  ],
  "books": [
    {
      "id": 2,
      "id": 3
    }
  ]
  },
  {
    "id": 2,
    "author": "Афанасий Фет",
    "author_photo": "covers/fet_photo",
    "authors_description": "Афанасий Афанасьевич Фет родился в 1820 г. в Орловской губернии. Он был сыном помещика Шеншина и немки, фамилия которой по-немецки писалась Foeth. Их брак, состоявшийся за границей, в России был недействителен. Таким образом, Фет официально был незаконнорожденным и до самого своего совершеннолетия оставался иностранным подданным. Это открытие, которое он сделал, когда уехал из дому учиться, было для него жестоким испытанием, и он потратил всю жизнь на то, чтобы получить права дворянина и имя своего отца. В конце концов он этого добился в 1876 г., когда получил «по высочайшему повелению» право носить фамилию Шеншин. Однако в литературе он до самой смерти сохранял свое прежнее имя.",
    "same_authors": [
      {
        "id": 0,
        "id": 1
      }
    ],
    "books": [
      {
        "id": 4,
        "id": 5
      }
    ]

  },
  {
    "id": 3,
    "author": "Всеволод Гаршин",
    "author_photo": "covers/garshin_photo",
    "authors_description": "Всеволод Гаршин происходил из помещичьей семьи; родился в 1855 г. в Донецком уезде. Гимназию окончил в Харькове, в 1873 г. поступил в Петербургский Горный институт, но его не закончил. Гаршин был человеком с необычайно развитым нравственным чувством, и так как он воспитывался в годы, последовавшие за освобождением крестьян, естественно, приобрел образ мыслей «кающегося дворянина». Это не привело его в стан политической борьбы за народ, но когда разразилась война с Турцией (1877), он пошел на войну солдатом. Сделал он это не из патриотизма и не из авантюризма, но от глубокого убеждения, что если народ страдает на фронте, его долг страдать вместе с народом.",
    "same_authors": [
      {
        "id": 4,
        "id": 5
      }
    ],
    "books": [
      {
        "id": 6,
        "id": 7
      }
    ]

  },
  {
    "id": 4,
    "author": "Александр Грин",
    "author_photo": "covers/grin_photo",
    "authors_description": "Грин родился 23 августа 1880 года в небольшом городке в Вятской губернии. Отец будущего писателя был выходцем из Польши, а мать – русской медсестрой. С детства мальчик мечтал о путешествиях, в особенности морских. Поэтому после окончания Вятского училища он поехал в Одессу, где стал матросом.",
    "same_authors": [
      {
        "id": 3,
        "id": 5
      }
    ],
    "books": [
      {
        "id": 8,
        "id": 9
      }
    ]
  },
  {
    "id": 5,
    "author": "Александр Куприн",
    "author_photo": "covers/kuprin_photo",
    "authors_description": "Александр Куприн – выдающийся русский писатель-реалист конца XIX века. Писатель родился 7 сентября 1870 года в уездном городе Наровчат Пензенской области, в семье потомственного дворянина. Отец писателя, Иван Иванович, умер вскоре после рождения сына. Мать, Любовь Алексеевна, была из рода татарских князей. После смерти мужа она переехала в Москву, где Александр в возрасте шести лет был отдан в сиротский пансион. В 1880 году он поступил в Московский кадетский корпус, а в 1887 – в Александровское военное училище.",
    "same_authors": [
      {
        "id": 3,
        "id": 4
      }
    ],
    "books": [
      {
        "id": 10,
        "id": 11
      }
    ]
  },
  {
    "id": 6,
    "author": "Николай Лесков",
    "author_photo": "covers/leskov_photo",
    "authors_description": "Николай Семёнович Лесков (1831 — 1895) – прозаик, самый народный писатель России, драматург. Родился 4 февраля (16 февраля) 1831 года в селе Горохове Орловской губернии в семье следователя и дочери обедневшего дворянина. У них было пятеро детей, Николай был старшим ребенком. Детство писателя прошло в городе Ореле. Автор известных романов, повестей и рассказов, таких как: “Некуда”, «Леди Макбет Мценского уезда», «На ножах», «Соборяне», “Левша” и многих других, создатель театральной пьесы “Расточитель”.",
    "same_authors": [
      {
        "id": 7,
        "id": 8
      }
    ],
    "books": [
      {
        "id": 12,
        "id": 13
      }
    ]
  },
  {
    "id": 7,
    "author": "Александр Пушкин",
    "author_photo": "covers/pushkin_photo",
    "authors_description": "Великий русский поэт и писатель, основоположник современного литературного русского языка, с именем которого связывают Золотой век отечественной литературы и поэзии.Александр Пушкин родился 26 мая (6 июня) 1799 года в небогатой дворянской семье. Начальное образование, как это было принято у дворян, маленький Пушкин получил дома, его обучением занимались учителя и гувернеры, приглашаемые родителями из разных стран Европы. При этом, несмотря на яркий ум, будущее светило русской поэзии никак нельзя было назвать прилежным учеником, преподаватели и родные отмечали в нем отсутствие усердия, но со временем мальчик увлекся чтением.",
    "same_authors": [
      {
        "id": 6,
        "id": 8
      }
    ],
    "books": [
      {
        "id": 14,
        "id": 15
      }
    ]
  },
  {
    "id": 8,
    "author": "Иван Тургенев",
    "author_photo": "covers/pushkin_photo",
    "authors_description": "Великий русский поэт и писатель, основоположник современного литературного русского языка, с именем которого связывают Золотой век отечественной литературы и поэзии.Александр Пушкин родился 26 мая (6 июня) 1799 года в небогатой дворянской семье. Начальное образование, как это было принято у дворян, маленький Пушкин получил дома, его обучением занимались учителя и гувернеры, приглашаемые родителями из разных стран Европы. При этом, несмотря на яркий ум, будущее светило русской поэзии никак нельзя было назвать прилежным учеником, преподаватели и родные отмечали в нем отсутствие усердия, но со временем мальчик увлекся чтением.",
    "same_authors": [
      {
        "id": 6,
        "id": 7
      }
    ],
    "books": [
      {
        "id": 16,
        "id": 17
      }
    ]
  },
  {
    "id": 9,
    "author": "Евгений Замятин",
    "author_photo": "covers/pushkin_photo",
    "authors_description": "Евгений Иванович Замятин – русский писатель, литературный критик и публицист. Писатель родился 1 февраля 1884 года в городе Лебедянь. Отец писателя был священником, а мать – пианисткой. Начальное образование Евгений получал в гимназии родного города, а затем в Воронеже. Блестяще окончив гимназию, в 1902 году он подал документы на кораблестроительный факультет Петербургского политехникума.\n\nВскоре стал участвовать в студенческой революционной жизни и записался в социл-демократы. В эти же годы он познакомился со своей будущей супругой – Людмилой Николаевной Усовой. В 1905 году он был арестован за большевистские агитации.",
    "same_authors": [
      {
        "id": 6,
        "id": 7
      }
    ],
    "books": [
      {
        "id": 18,
        "id": 19
      }
    ]
  }
  ]
}
